terraform plan:
```
aws_vpc.dev_vpc: Refreshing state... [id=vpc-0e434fc937ec7c46c]
aws_internet_gateway.gw: Refreshing state... [id=igw-0d13bdb32f42b8240]
aws_subnet.dev_us_east_1a: Refreshing state... [id=subnet-031948f8e811d6a18]
aws_instance.dev[0]: Refreshing state... [id=i-0aa7c977162df939b]
cloudflare_record.dev[0]: Refreshing state... [id=84c3f1c56ddfc9aaf15b120458253d22]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.dev[0] has been deleted
  - resource "aws_instance" "dev" {
      - ami                                  = "ami-031283ff8a43b021c" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:221354683935:instance/i-0aa7c977162df939b" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 2 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0aa7c977162df939b" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.large" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "Kaveh" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0405cf804d408d6b0" -> null
      - private_dns                          = "ip-172-16-10-14.ec2.internal" -> null
      - private_ip                           = "172.16.10.14" -> null
      - public_dns                           = "ec2-3-86-218-60.compute-1.amazonaws.com" -> null
      - public_ip                            = "3.86.218.60" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-031948f8e811d6a18" -> null
      - tags                                 = {
          - "Name" = "dev"
        } -> null
      - tags_all                             = {
          - "Name" = "dev"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "2d85055cb154bbbebeecd4e357073ec328c0896d" -> null
      - vpc_security_group_ids               = [
          - "sg-007ae9d2199ea1f25",
          - "sg-09bafcc41daecda49",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-02c967a5692efb64a" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }
  # cloudflare_record.dev[0] has been deleted
  - resource "cloudflare_record" "dev" {
      - allow_overwrite = false -> null
      - created_on      = "2021-11-04T15:28:44.981217Z" -> null
      - data            = {} -> null
      - hostname        = "dev0.zamani.me" -> null
      - id              = "84c3f1c56ddfc9aaf15b120458253d22" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2021-11-04T19:12:33.59625Z" -> null
      - name            = "dev0" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - ttl             = 120 -> null
      - type            = "A" -> null
      - value           = "3.86.218.60" -> null
      - zone_id         = (sensitive) -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.dev[0] will be created
  + resource "aws_instance" "dev" {
      + ami                                  = "ami-031283ff8a43b021c"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.large"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "Kaveh"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-031948f8e811d6a18"
      + tags                                 = {
          + "Name" = "dev"
        }
      + tags_all                             = {
          + "Name" = "dev"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "2d85055cb154bbbebeecd4e357073ec328c0896d"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-007ae9d2199ea1f25",
          + "sg-09bafcc41daecda49",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # cloudflare_record.dev[0] will be created
  + resource "cloudflare_record" "dev" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dev0"
      + proxiable       = (known after apply)
      + ttl             = 120
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ dev_ip = [
      - "3.86.218.60",
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```